Was able to verify this behavior with a test,

> === RUN   TestAccAWSLakeFormation_serial/Permissions/selectPermissions
>     resource_aws_lakeformation_permissions_test.go:215: Step 1/2 error: After applying this test step, the plan was not empty.
>         stdout:
>         
>         
>         An execution plan has been generated and is shown below.
>         Resource actions are indicated with the following symbols:
>         -/+ destroy and then create replacement
>         
>         Terraform will perform the following actions:
>         
>           # aws_lakeformation_permissions.test must be replaced
>         -/+ resource "aws_lakeformation_permissions" "test" {
>               ~ id                            = "840914301" -> (known after apply)
>               ~ permissions                   = [
>                     # (5 unchanged elements hidden)
>                     "INSERT",
>                   + "SELECT",
>                 ]
>               ~ permissions_with_grant_option = [
>                     # (5 unchanged elements hidden)
>                     "INSERT",
>                   + "SELECT",
>                 ]
>                 # (2 unchanged attributes hidden)
>         
>               + data_location {
>                   + arn        = (known after apply)
>                   + catalog_id = (known after apply)
>                 }
>         
>               + database {
>                   + catalog_id = (known after apply)
>                   + name       = (known after apply)
>                 }
>         
>               ~ table {
>                   ~ catalog_id    = "723063952537" -> (known after apply)
>                     name          = "tf-acc-test-4091274688649715014"
>                     # (2 unchanged attributes hidden)
>                 }
>         
>               + table_with_columns {
>                   + catalog_id            = (known after apply)
>                   + column_names          = (known after apply)
>                   + database_name         = (known after apply)
>                   + excluded_column_names = (known after apply)
>                   + name                  = (known after apply)
>                 }
>             }
>         
>         Plan: 1 to add, 0 to change, 1 to destroy.